ulvge/STM32103_2024_BASE/Core/api/cm_backtrace/cm_backtrace.c
    CMB_ASSERT(init_ok);
    /* only call once */
    CMB_ASSERT(!on_fault);

    on_fault = true;

	g_isPrintUseFifo = false;
    cmb_println("");
    cm_backtrace_firmware_info();

#ifdef CMB_USING_OS_PLATFORM
    on_thread_before_fault = fault_handler_lr & (1UL << 2);
    /* check which stack was used before (MSP or PSP) */
    if (on_thread_before_fault) {
        cmb_println(print_info[PRINT_FAULT_ON_THREAD], get_cur_thread_name() != NULL ? get_cur_thread_name() : "NO_NAME");
        saved_regs_addr = stack_pointer = cmb_get_psp();

#ifdef CMB_USING_DUMP_STACK_INFO
        get_cur_thread_stack_info(stack_pointer, &stack_start_addr, &stack_size);
#endif /* CMB_USING_DUMP_STACK_INFO */

    } else {
        cmb_println(print_info[PRINT_FAULT_ON_HANDLER]);
    }
#else
    /* bare metal(no OS) environment */
    cmb_println(print_info[PRINT_FAULT_ON_HANDLER]);
#endif /* CMB_USING_OS_PLATFORM */

    /* delete saved R0~R3, R12, LR,PC,xPSR registers space */
    stack_pointer += sizeof(size_t) * 8;

#if (CMB_CPU_PLATFORM_TYPE == CMB_CPU_ARM_CORTEX_M4) || (CMB_CPU_PLATFORM_TYPE == CMB_CPU_ARM_CORTEX_M7) || \
    (CMB_CPU_PLATFORM_TYPE == CMB_CPU_ARM_CORTEX_M33)
    stack_pointer = statck_del_fpu_regs(fault_handler_lr, stack_pointer);
#endif /* (CMB_CPU_PLATFORM_TYPE == CMB_CPU_ARM_CORTEX_M4) || (CMB_CPU_PLATFORM_TYPE == CMB_CPU_ARM_CORTEX_M7) */

#ifdef CMB_USING_DUMP_STACK_INFO
    /* check stack overflow */
    if (stack_pointer < stack_start_addr || stack_pointer > stack_start_addr + stack_size) {
        stack_is_overflow = true;
    }
    /* dump stack information */
    dump_stack(stack_start_addr, stack_size, (uint32_t *) stack_pointer);
#endif /* CMB_USING_DUMP_STACK_INFO */

    /* the stack frame may be get failed when it is overflow  */
    if (!stack_is_overflow) {
        /* dump register */
        cmb_println(print_info[PRINT_REGS_TITLE]);

        regs.saved.r0        = ((uint32_t *)saved_regs_addr)[0];  // Register R0
        regs.saved.r1        = ((uint32_t *)saved_regs_addr)[1];  // Register R1
        regs.saved.r2        = ((uint32_t *)saved_regs_addr)[2];  // Register R2
        regs.saved.r3        = ((uint32_t *)saved_regs_addr)[3];  // Register R3
        regs.saved.r12       = ((uint32_t *)saved_regs_addr)[4];  // Register R12
        regs.saved.lr        = ((uint32_t *)saved_regs_addr)[5];  // Link register LR
        regs.saved.pc        = ((uint32_t *)saved_regs_addr)[6];  // Program counter PC
        regs.saved.psr.value = ((uint32_t *)saved_regs_addr)[7];  // Program status word PSR

        cmb_println("  %s: %08x  %s: %08x  %s: %08x  %s: %08x", regs_name[0], regs.saved.r0,
                                                                regs_name[1], regs.saved.r1,
                                                                regs_name[2], regs.saved.r2,
                                                                regs_name[3], regs.saved.r3);
        cmb_println("  %s: %08x  %s: %08x  %s: %08x  %s: %08x", regs_name[4], regs.saved.r12,
                                                                regs_name[5], regs.saved.lr,
                                                                regs_name[6], regs.saved.pc,
                                                                regs_name[7], regs.saved.psr.value);
        cmb_println("==============================================================");
        
        cm_backtrace_hook(regs.saved.lr, regs.saved.pc);
    }

    /* the Cortex-M0 is not support fault diagnosis */
#if (CMB_CPU_PLATFORM_TYPE != CMB_CPU_ARM_CORTEX_M0)
    regs.syshndctrl.value = CMB_SYSHND_CTRL;  // System Handler Control and State Register
    regs.mfsr.value       = CMB_NVIC_MFSR;    // Memory Fault Status Register
    regs.mmar             = CMB_NVIC_MMAR;    // Memory Management Fault Address Register
    regs.bfsr.value       = CMB_NVIC_BFSR;    // Bus Fault Status Register
    regs.bfar             = CMB_NVIC_BFAR;    // Bus Fault Manage Address Register
    regs.ufsr.value       = CMB_NVIC_UFSR;    // Usage Fault Status Register
    regs.hfsr.value       = CMB_NVIC_HFSR;    // Hard Fault Status Register
    regs.dfsr.value       = CMB_NVIC_DFSR;    // Debug Fault Status Register
    regs.afsr             = CMB_NVIC_AFSR;    // Auxiliary Fault Status Register

    fault_diagnosis();
#endif

    print_call_stack(stack_pointer);
}

// hook
static RTC_HandleTypeDef hrtc = {
    .Instance = RTC,
};

#define HARDFAULT_STACK_SAVED_BUFF_SIZE 30
#define HARDFAULT_STACK_SAVED_GROUP_COUNT (HARDFAULT_STACK_SAVED_BUFF_SIZE >> 1)

static void cm_backtrace_hook(uint32_t lr, uint32_t pc) {
//    __HAL_RCC_BKPRAM_CLK_ENABLE();
//    uint32_t errorTotalCount = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR31);

//    uint32_t idx = errorTotalCount % HARDFAULT_STACK_SAVED_GROUP_COUNT;
//    HAL_PWR_EnableBkUpAccess();
//    HAL_RTCEx_BKUPWrite(&hrtc, 2 * idx, lr);
//    HAL_RTCEx_BKUPWrite(&hrtc, 2 * idx + 1, pc);

//    errorTotalCount++;
//    HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR31, errorTotalCount);
}

// shell command
static void display_usage(void)
{
    LOG_RAW("\t\t hf: to Get HardFault records \r\n");
    return;
}

static int HardFault_shell(int argc, char *argv[])
{
    if (argc != 1)
    {
        display_usage();
        return 0;
    }
    
    LOG_RAW(" ***** Get HardFault records *****\r\n\r\n");
    uint32_t errorTotalCount = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR31);
    if (!errorTotalCount){
        LOG_RAW("\t not record HardFault msg yet\r\n");
        return 0;
    }
    uint32_t recordsCount = errorTotalCount <= HARDFAULT_STACK_SAVED_GROUP_COUNT ? errorTotalCount : HARDFAULT_STACK_SAVED_GROUP_COUNT;
    LOG_RAW("\t    lr               pc\r\n");
    for (size_t i = 0; i < recordsCount; i++)
    {
        uint32_t lr = HAL_RTCEx_BKUPRead(&hrtc, 2 * i);
        uint32_t pc = HAL_RTCEx_BKUPRead(&hrtc, 2 * i + 1);
        LOG_RAW("\t    lr               pc\r\n");
        LOG_RAW("\t %-12hx   %-12hx\r\n", lr, pc);
    }
    return 0;
}
SHELL_EXPORT_CMD(SHELL_CMD_PERMISSION(0) | SHELL_CMD_TYPE(SHELL_TYPE_CMD_MAIN) | SHELL_CMD_DISABLE_RETURN, hf, HardFault_shell, Get HardFault records);

